Tekla Open API Reference for Tekla Structures 2025
AnalysisVolume.Material Property
 The material of the analysis volume.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisMaterial Material { get; }
Public ReadOnly Property Material As AnalysisMaterial
	Get
Property Value
Type: AnalysisMaterial
See Also
Reference
AnalysisVolume Class
Tekla.Structures.Analysis Namespace